#set_host_options -max_cores 4

## - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
## Setup
## - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

## Add primary libraries here ##
set search_path "$search_path "

set target_library ""

set symbol_library   ""
#set symbol_library   "dw_foundation.sldb"
set link_library     "* $target_library $symbol_library"

## Add benchmark circuits here ##
set design dut

analyze -format verilog dut.v


elaborate $design

current_design $design

link

## setup constraints, of course an external file can be called ##
set period 15
set uncertainty [expr 0.1*${period}]
set transition [expr 0.03*${period}]
set iodelay [expr 0.5*${period}]

create_clock -period ${period} [get_ports CK]
set_clock_uncertainty ${uncertainty} [get_ports CK]
set_clock_transition ${transition} [get_clocks CK]
set_input_delay -max ${iodelay} -clock CK [remove_from_collection [all_inputs] [get_ports CK]]
set_output_delay -max ${iodelay} -clock CK [all_outputs]


set compile_seqmap_enable_output_inversion true

set_max_leakage_power 0
set_wire_load_mode segmented
set_fix_hold CK 

## library subsets to be used, it will be generated by the scripts ##
## of course you can add more cell types ##
set invs {}
set muxs {}
set nd2s {}
set nr2s {}
set dffs {}

set_dont_use {lib/*}
set cell_to_use [concat $invs $muxs $nd2s $nr2s $dffs]

foreach cell ${cell_to_use} {
	remove_attribute [get_cells lib/$cell] dont_use
}

compile

## reports to be parsed for spec. evaluation ##
report_timing > timing.rpt

report_power -hier > power_hier.rpt

report_power -hier > area_hier.rpt

exec sh -c {rm -rf *.pvl *.syn *.svf *.mr *.log }

exit
